{
    "2017-07-26 18:09:23": [
        {
            "user": "dan_parham"
        },
        {
            "text": "I'm up for sharing an apartment as long as the cost is reasonable, it'd be great to stay with some holberton students."
        }
    ],
    "2017-08-20 20:12:52": [
        {
            "user": "tim.britton"
        },
        {
            "text": "(tldr; not a bad place at all, been here about 10 months and don't mind it at all, but some people might not wanna live here)"
        }
    ],
    "2017-08-17 03:56:33": [
        {
            "user": "nellybeanz"
        },
        {
            "text": "<@U6DJVN0TV> I did use the SF housing group on Facebook "
        }
    ],
    "2017-07-02 01:17:09": [
        {
            "user": "sravanthi"
        },
        {
            "text": "<@U0FEBCR54|sravanthi> has left the channel"
        }
    ],
    "2017-07-15 19:44:06": [
        {
            "user": "tommy"
        },
        {
            "text": "<@U5ZSUKV6C> i lived there the first month of school. location is great, the open areas upstairs and downstairs are great. generally pretty clean but lots of bugs - cockroaches in the kitchen area that they can't get rid of (it's neighboring a popular bar). everyone is basically packed in one space (like military style bunk beds) because the building is a commercial building they makeshifted into a living area. The people are very very interesting and there are definitely lots of founders/entreprenuers/programmers/bootcampers there that all have big dreams so you'll have a lot to talk about. I used to stay up pretty late having really interesting convos with all of them."
        }
    ],
    "2017-08-09 20:31:03": [
        {
            "user": "michael_s"
        },
        {
            "text": "I’m doing the quad room at SFSH staying in startuphouse for this month until a room sept when the room is available"
        }
    ],
    "2017-07-01 17:56:14": [
        {
            "user": "nooplion"
        },
        {
            "text": "Was in the same boat at you were <@U5ZSUKV6C> and after doing research. Adelaide Hostel offered the \"most bang for the buck\". ~$800 / month,  solid breakfast and prime location. "
        }
    ],
    "2017-08-02 04:09:06": [
        {
            "user": "yunju"
        },
        {
            "text": "<@U6HPFTURL|yunju> has joined the channel"
        }
    ],
    "2017-08-20 17:09:22": [
        {
            "user": "klucc"
        },
        {
            "text": "<@U6C12JTCN> I'm flying there on the 26 so as soon as I pick a place.  Have a few places to check out. Yes a using Craig's and Facebook groups, lots of scams on craigs but there is a lot "
        }
    ],
    "2017-08-07 17:17:37": [
        {
            "user": "cameronlpm"
        },
        {
            "text": "<@U654GRQSV|cameronlpm> has joined the channel"
        }
    ],
    "2017-08-09 18:37:21": [
        {
            "user": "biehlerj"
        },
        {
            "text": "I took at tour of SFSH and looked at the double and it's only like half a foot wider for the bottom bunk and you don't have to climb up to get to your bed. So if that is worth the extra $40 a month to you then yes otherwise no."
        }
    ],
    "2017-07-01 17:58:46": [
        {
            "user": "nooplion"
        },
        {
            "text": "It's a great affordable and affable place to stay for short term. It allows you to do your housing research in person before signing any contract for long term. "
        }
    ],
    "2017-07-26 02:41:38": [
        {
            "user": "naomi"
        },
        {
            "text": "<@U3A6GN8AF|naomi> has left the channel"
        }
    ],
    "2017-07-21 18:47:12": [
        {
            "user": "egsy"
        },
        {
            "text": "Hey Jacob! I don't know much about BART but I do know that <@U3Z2A8LAZ> is familiar with the Concord area~!!"
        }
    ],
    "2017-07-21 21:46:53": [
        {
            "user": "tim.britton"
        },
        {
            "text": "<@U2379M0TA> was taking the BART from walnut creek for awhile and it was pretty awful. You'll end up spending a good chunk of change on BART. And <@U570R09GB> is right, you really just need a place to sleep."
        }
    ],
    "2017-07-21 01:54:19": [
        {
            "user": "mageliz"
        },
        {
            "text": "<@U6BMPP6TU|mageliz> has joined the channel"
        }
    ],
    "2017-07-26 03:40:39": [
        {
            "user": "klucc"
        },
        {
            "text": "<@U6DJVN0TV|klucc> has joined the channel"
        }
    ],
    "2017-07-24 22:42:21": [
        {
            "user": "nellybeanz"
        },
        {
            "text": "Count me in! The more people the cheaper it is. Plus it would be kind of cool to room with people from school. It would be like a little family :blush:"
        }
    ],
    "2017-08-21 15:31:33": [
        {
            "user": "nellybeanz"
        },
        {
            "text": "Yeah I found something about a month ago and have the place already. Definitely hope you find something! It might be hard sometimes but there are definitely places out there :) "
        }
    ],
    "2017-08-09 20:34:47": [
        {
            "user": "michael_s"
        },
        {
            "text": "I like startup house a lot it’s obviously more crowded here than SFSH, but it’s a good vibe and the people here are really cool. The main reason I’m moving is because it’s about half the price at SFSH."
        }
    ],
    "2017-08-17 02:18:19": [
        {
            "user": "klucc"
        },
        {
            "text": "Not looking for housing but a room. Did you use the SF housing group?"
        }
    ],
    "2017-07-10 22:48:59": [
        {
            "user": "eightlimbed"
        },
        {
            "text": "<@U5ZSUKV6C> I'm a future student starting in September, also looking for housing. I've looked into SF Student Housing (they have some available rooms), and Startup Bed. I'm hesitant to send a deposit to SF Student Housing, though, because there are some pretty bad reviews online. Any Holberton students living there, or have any recommendations?"
        }
    ],
    "2017-07-20 01:05:54": [
        {
            "user": "apileggi85"
        },
        {
            "text": "<@U6C12JTCN|apileggi85> has joined the channel"
        }
    ],
    "2017-07-10 18:43:59": [
        {
            "user": "mandonuno"
        },
        {
            "text": "<@U66KHJLCD|mandonuno> has joined the channel"
        }
    ],
    "2017-07-22 02:47:33": [
        {
            "user": "j-tyler"
        },
        {
            "text": "To echo everyone else, I highly recommend a short term place in the city."
        }
    ],
    "2017-07-19 04:11:19": [
        {
            "user": "biehlerj"
        },
        {
            "text": "<@U51V26DGX> and others who live in SFSH have you guys heard of or had any problems with theft in the building or is pretty safe to bring things up with you like an Xbox and computer monitors and whatnot?"
        }
    ],
    "2017-07-15 19:02:44": [
        {
            "user": "michael_s"
        },
        {
            "text": "Has anyone gone with StartupBed? If so do you feel it was worth the price difference? and how was location? plus any other info about it as well would be greatly appreciated :slightly_smiling_face:"
        }
    ],
    "2017-07-28 01:06:47": [
        {
            "user": "dgarvey"
        },
        {
            "text": "<@U6ER5CNQJ|dgarvey> has joined the channel"
        }
    ],
    "2017-07-15 20:58:22": [
        {
            "user": "tommy"
        },
        {
            "text": "<@U5XJR9B8D> yep! Look forward to meeting u and <@U5ZSUKV6C> "
        }
    ],
    "2017-08-20 17:10:00": [
        {
            "user": "klucc"
        },
        {
            "text": "There are a lot of apartments to check out. Nice find! Looks easy to get to holberton as well."
        }
    ],
    "2017-07-15 20:51:53": [
        {
            "user": "biehlerj"
        },
        {
            "text": "<@U51V26DGX> that is good to hear, I'm definitely looking for something affordable and the fact that is close to the school makes it even more desirable. Its good to know that other people from the school might be there as well"
        }
    ],
    "2017-08-20 16:52:08": [
        {
            "user": "klucc"
        },
        {
            "text": "<@U5ZSUKV6C> hey Michael! Did you find a place? If not it would be cool to look for an apt to share with other people as well "
        }
    ],
    "2017-07-28 06:39:15": [
        {
            "user": "dgarvey"
        },
        {
            "text": "<@U6ER5CNQJ|dgarvey> has left the channel"
        }
    ],
    "2017-07-15 19:46:11": [
        {
            "user": "michael_s"
        },
        {
            "text": "Any roaches at SFSH?"
        }
    ],
    "2017-07-11 03:13:23": [
        {
            "user": "nooplion"
        },
        {
            "text": "spoiler* he was eagerly waiting for his lease to expire."
        }
    ],
    "2017-07-21 03:15:28": [
        {
            "user": "nellybeanz"
        },
        {
            "text": "<@U6B6H4V2M|nellybeanz> has joined the channel"
        }
    ],
    "2017-08-09 17:27:40": [
        {
            "user": "nellybeanz"
        },
        {
            "text": "I found a room to rent for pretty cheap (by SF standards) through a Facebook group. Just depends on your budget. There is also student housing as an option. "
        }
    ],
    "2017-07-24 22:35:10": [
        {
            "user": "apileggi85"
        },
        {
            "text": "Any folks thinking about getting an apartment in groups together to lower costs?"
        }
    ],
    "2017-07-19 04:50:48": [
        {
            "user": "larry2"
        },
        {
            "text": "No theft.  I had good roommates."
        }
    ],
    "2017-07-10 22:57:06": [
        {
            "user": "larry2"
        },
        {
            "text": "It's crowded and noisy, very much like a college dorm.  But it's hard to find a cheaper place to live in SF ..."
        }
    ],
    "2017-08-11 18:42:37": [
        {
            "user": "sanderson"
        },
        {
            "text": "<@U6MKKG50C|sanderson> has joined the channel"
        }
    ],
    "2017-07-07 21:25:45": [
        {
            "user": "cameronlpm"
        },
        {
            "text": "<@U654GRQSV|cameronlpm> has joined the channel"
        }
    ],
    "2017-07-11 00:40:15": [
        {
            "user": "tanyak"
        },
        {
            "text": "<@U4KD7JLF3|tanyak> has left the channel"
        }
    ],
    "2017-08-05 13:22:48": [
        {
            "user": "klucc"
        },
        {
            "text": "Hi guys what is your apartment situation? I've been looking on Facebook groups and Craig's but I only have one week to look at the places since I'm flying out to SF Aug 26"
        }
    ],
    "2017-07-10 22:40:51": [
        {
            "user": "eightlimbed"
        },
        {
            "text": "<@U66482V33|eightlimbed> has joined the channel"
        }
    ],
    "2017-07-08 19:20:58": [
        {
            "user": "kiren"
        },
        {
            "text": "<@U48JY609Y|kiren> has left the channel"
        }
    ],
    "2017-08-24 16:31:08": [
        {
            "user": "vkalia"
        },
        {
            "text": "I am looking for a place too right now. I was skeptical doing it online without even visiting the place once. I will move on 25th and go from there."
        }
    ],
    "2017-07-13 18:17:27": [
        {
            "user": "cameronlpm"
        },
        {
            "text": "<@U654GRQSV|cameronlpm> has left the channel"
        }
    ],
    "2017-07-19 04:26:00": [
        {
            "user": "tommy"
        },
        {
            "text": "haven't had a problem. but i don't really have anything worth stealing and always have my laptop on me. <@U2377RNJU> <@U48JY609Y> <@U3Y235NDA> any issues with this?"
        }
    ],
    "2017-07-24 22:36:26": [
        {
            "user": "biehlerj"
        },
        {
            "text": "I would be open to that depending on the cost/commute to school."
        }
    ],
    "2017-07-15 19:10:00": [
        {
            "user": "naomi"
        },
        {
            "text": "<@U35J0JMEE> <@U3W4WAY5B>  any perspective on this?"
        }
    ],
    "2017-07-19 04:52:44": [
        {
            "user": "larry2"
        },
        {
            "text": "You will like SFSH about as much as you would like a college dorm, that's basically what it is."
        }
    ],
    "2017-07-01 17:58:20": [
        {
            "user": "sgrcia"
        },
        {
            "text": "<@U0EQZP8BY|sgrcia> has left the channel"
        }
    ],
    "2017-08-09 20:46:58": [
        {
            "user": "biehlerj"
        },
        {
            "text": "I didn't notice any difference in length because the ladder to the top bunk was at the foot of the bed."
        }
    ],
    "2017-08-01 00:39:01": [
        {
            "user": "lancesanity"
        },
        {
            "text": "<@U6F1THWNS|lancesanity> has left the channel"
        }
    ],
    "2017-08-21 21:24:03": [
        {
            "user": "michael_s"
        },
        {
            "text": "hey <@U6DJVN0TV> right now I’m staying at startup house and as of Sept 5th I have a 6 month lease with SFSH"
        }
    ],
    "2017-08-24 23:12:00": [
        {
            "user": "tim.britton"
        },
        {
            "text": "Adelaide/Dakota is good for a short term place to crash while you look!"
        }
    ],
    "2017-08-20 17:11:23": [
        {
            "user": "apileggi85"
        },
        {
            "text": "<@U6DJVN0TV> oh okay cool. If I see anything reasonable, I'll keep you posted "
        }
    ],
    "2017-08-09 18:34:53": [
        {
            "user": "romalms10"
        },
        {
            "text": "<@U53R7H5DK|romalms10> has joined the channel"
        }
    ],
    "2017-07-15 20:46:49": [
        {
            "user": "biehlerj"
        },
        {
            "text": "<@U51V26DGX> how are you liking SFSH so far? are there any other bootcampers/programmers there as well? I'm applying for the double room up there and was accepted to it."
        }
    ],
    "2017-08-07 17:19:46": [
        {
            "user": "cameronlpm"
        },
        {
            "text": "Hey Jacob, just wanted to chime in since I'll also be living outside of the city and using public transit for commuting every day -- you can get a monthly BART + Muni pass for a very reasonable amount, around $95/month I think"
        }
    ],
    "2017-08-09 18:54:30": [
        {
            "user": "romalms10"
        },
        {
            "text": "Half a foot wider, but what about the length?"
        }
    ],
    "2017-08-22 15:54:48": [
        {
            "user": "tim.britton"
        },
        {
            "text": "Well Treasure Island is a dumpsite, it's a man made island. Yerba Buena is a 'real island' and they built TI off of Yerba Buena, originally for the World's Fair (iirc, some fair for certain) and then it was a Navy base, now housing"
        }
    ],
    "2017-07-21 18:51:48": [
        {
            "user": "naomi"
        },
        {
            "text": "Just keep in mind that bart adds up from concord area-- like $9 a day (?)"
        }
    ],
    "2017-08-09 18:36:05": [
        {
            "user": "romalms10"
        },
        {
            "text": "For people staying at SFSH, is the bottom bunk really worth $40/month more than the top bunk?"
        }
    ],
    "2017-07-21 18:22:41": [
        {
            "user": "jhartman"
        },
        {
            "text": "Howdy team. I'm considering moving to Walnut Creek/Concord during my time at Holberton, though I haven't seen anybody else mention the East Bay. If I had to commute by car I wouldn't consider it. Is there anyone who is in this arrangement and commuting by BART? Any recommendations against it? My reasons for that area include: it has lower prices for a private room while still being in a nice area, 35 minute BART ride, freedom to use my car, and probably a few other reasons that are escaping me."
        }
    ],
    "2017-07-20 01:01:14": [
        {
            "user": "choijam"
        },
        {
            "text": "<@U6B841KQD|choijam> has joined the channel"
        }
    ],
    "2017-08-20 16:54:00": [
        {
            "user": "klucc"
        },
        {
            "text": "<@U6C12JTCN> <@U5XJR9B8D> <@U6B6H4V2M> did you guys get yourselves situated? I'm down for a place. Looking on trullia there's quite a few options."
        }
    ],
    "2017-06-30 23:04:17": [
        {
            "user": "daveyoon64"
        },
        {
            "text": "<@U62HB74Q2|daveyoon64> has joined the channel"
        }
    ],
    "2017-08-18 21:56:03": [
        {
            "user": "hc"
        },
        {
            "text": "<@U3W4WAY5B|hc> has joined the channel"
        }
    ],
    "2017-08-21 00:26:11": [
        {
            "user": "egsy"
        },
        {
            "text": "<@U2205GWFM> this sounds like a Stranger Things plot line O_o"
        }
    ],
    "2017-08-09 03:57:20": [
        {
            "user": "nappybrain"
        },
        {
            "text": "<@U0EQYDDLZ|nappybrain> has left the channel"
        }
    ],
    "2017-07-15 19:49:49": [
        {
            "user": "tommy"
        },
        {
            "text": "<@U5ZSUKV6C> not that i know of but I haven't used the kitchen at all. I had mosquitos in my room in SFSH (seems like an isolated incident though) but they installed screens pretty quickly and i bought a mosquito net."
        }
    ],
    "2017-07-11 03:11:16": [
        {
            "user": "nooplion"
        },
        {
            "text": "<@U66482V33> Trust me this is a solid safe options to stay while your look for research for more permanent option."
        }
    ],
    "2017-07-13 21:48:54": [
        {
            "user": "jujeu"
        },
        {
            "text": "<@U68JFEWNP|jujeu> has joined the channel"
        }
    ],
    "2017-07-12 02:31:29": [
        {
            "user": "bsylvester"
        },
        {
            "text": "<@U68858ZJS|bsylvester> has joined the channel"
        }
    ],
    "2017-07-01 22:50:23": [
        {
            "user": "asaiapalacios"
        },
        {
            "text": "<@U0GCHKPTM|asaiapalacios> has left the channel"
        }
    ],
    "2017-07-01 13:35:03": [
        {
            "user": "michael_s"
        },
        {
            "text": "Hello, I’m Michael Schechner , a future batch 4 student moving out there from the Northeast. As of now the plan is hostels at least for the short-run. What are other people doing regarding housing? Is anyone looking to split a place preferably with several other students ?"
        }
    ],
    "2017-08-20 20:12:16": [
        {
            "user": "tim.britton"
        },
        {
            "text": "I'll ping <@U6DJVN0TV> for this if you're also looking here. Here's my general review:\n\nBuildings on TI are older, neighborhoods are OK, not really sketchy by any means, but not like... nice. There's a grocery store and a little convenience store shack thingy and that's about it. One upside is there's a lot of street parking, one downside is that you cannot get to the city without taking the bus/driving a vehicle. The bus comes \"every\" 15 during the day and \"every\" 30 at night, 24/7, but I've had to wait an hour for it to show up before. Traffic on the bridge blows almost 24/7.\n\nKinda big caveat: the buildings are all on a list for being removed, so you might one day get 30 days notice to leave so they can bulldoze your house. Chances are this won't happen for a couple years. \n\n...also there's high levels of radiation and heavy metal poisoning in the soil which is why there's a bunch of houses that got boarded up &amp;&amp; fenced off and have gigantic warning signs. Like I've had government dudes with geiger counters in my lawn."
        }
    ],
    "2017-08-20 17:12:14": [
        {
            "user": "klucc"
        },
        {
            "text": "<@U6C12JTCN> thanks man!"
        }
    ],
    "2017-08-20 20:06:41": [
        {
            "user": "tim.britton"
        },
        {
            "text": "There's a few students on TI, lmk if you need anything/have any questions"
        }
    ],
    "2017-07-10 23:52:33": [
        {
            "user": "tommy"
        },
        {
            "text": "<@U66482V33> it's not bad. they clean bathrooms every day and you have sheets replaced every 2 weeks. it's also about a 25 min walk from school, all one street so pretty convenient"
        }
    ],
    "2017-07-13 23:56:21": [
        {
            "user": "raid55"
        },
        {
            "text": "<@U682F57CG|raid55> has joined the channel"
        }
    ],
    "2017-07-15 19:45:32": [
        {
            "user": "tommy"
        },
        {
            "text": "So depending on what you're looking for it may or may not be worth the price (when I was there I was told I could only get the student discount $1080 for 3 months and after it would go up to $1200). I'm staying at SFSH right now and paying $605/month."
        }
    ],
    "2017-08-24 17:33:46": [
        {
            "user": "nooplion"
        },
        {
            "text": "Definitely smart!"
        }
    ],
    "2017-07-21 03:30:38": [
        {
            "user": "tim.britton"
        },
        {
            "text": "Yeah I doubt you'd need to worry. Lotta consoles and stuff around."
        }
    ],
    "2017-07-19 23:58:51": [
        {
            "user": "linds"
        },
        {
            "text": "<@U6AHET86M|linds> has joined the channel"
        }
    ],
    "2017-08-24 16:12:13": [
        {
            "user": "vkalia"
        },
        {
            "text": "<@U6TCCAQFP|vkalia> has joined the channel"
        }
    ],
    "2017-08-29 07:17:43": [
        {
            "user": "choijam"
        },
        {
            "text": "<@U6B841KQD|choijam> has left the channel"
        }
    ],
    "2017-08-21 19:09:29": [
        {
            "user": "klucc"
        },
        {
            "text": "Wow my dad works in that field, is the poisoning due to a dumpsite? Thanks for the rundown of TI"
        }
    ],
    "2017-08-03 00:44:31": [
        {
            "user": "vilyanare"
        },
        {
            "text": "<@U6HBANWLB|vilyanare> has joined the channel"
        }
    ],
    "2017-07-15 20:49:50": [
        {
            "user": "tommy"
        },
        {
            "text": "<@U5XJR9B8D> it's alright, definitely livable and don't think there's a more affordable place in SF. <@U48JY609Y> <@U2377RNJU> @josephmcdaniel are all there"
        }
    ],
    "2017-07-21 19:30:05": [
        {
            "user": "alexa_inga"
        },
        {
            "text": "Hi Jacob! I don’t recommend it. The $9 adds up and also if you have to drive to bart, the parking is not only expensive but also hard to get prior to 6:30am. Also its not rare to have late nights here and the last train is at midnight, if you miss it you’re stuck out here. To be honest, once you start school you basically just go home to shower, change clothes, and occasionally sleep lol. Might as well have something more convenient."
        }
    ],
    "2017-07-19 04:15:36": [
        {
            "user": "naomi"
        },
        {
            "text": ":+1::skin-tone-2::ok_hand::skin-tone-2::v::skin-tone-2:"
        }
    ],
    "2017-07-19 04:14:41": [
        {
            "user": "biehlerj"
        },
        {
            "text": "I mean, it's more so I can watch TV during the weekends because my parents use Sling TV."
        }
    ],
    "2017-08-07 21:36:23": [
        {
            "user": "henry"
        },
        {
            "text": "<@U6KBAMBQA|henry> has joined the channel"
        }
    ],
    "2017-08-20 17:02:07": [
        {
            "user": "apileggi85"
        },
        {
            "text": "<@U6DJVN0TV>  Hey! Yea I've found a place already.  Look on CL, I found a fairly cheap monthly rate on treasure island. Easy transportation to the school from there. when are you planning on moving?"
        }
    ],
    "2017-07-19 04:14:00": [
        {
            "user": "naomi"
        },
        {
            "text": "#blessup if you find time for Xbox at holberton :relaxed:"
        }
    ],
    "2017-08-09 18:30:02": [
        {
            "user": "naomi"
        },
        {
            "text": "<@U3A6GN8AF|naomi> has joined the channel"
        }
    ],
    "2017-07-26 20:37:45": [
        {
            "user": "lancesanity"
        },
        {
            "text": "<@U6F1THWNS|lancesanity> has joined the channel"
        }
    ]
}